import { notoSherif } from '@/app/fonts';

export default function PrivacyPolicyPage() {
  return (
    <main
      className={`${notoSherif.className} mx-auto my-20 max-w-6xl p-2 text-gray-600`}
    >
      {/* Section 1: Who We Are */}
      <section className="mb-8">
        <h1 className="mb-4 text-3xl font-bold">আমরা কারা :</h1>
        <p className="mb-4">
          techstudio.com.bd হল বাংলাদেশের একটি ডেডিকেটেড অনলাইন স্টোর যা বিভিন্ন
          ধরনের ইলেকট্রনিক পণ্য এবং ভোক্তা পণ্য যেমন মোবাইল, ট্যাবলেট, ল্যাপটপ,
          মোবাইল এক্সেসরিজ, হোম অ্যাপ্লায়েন্সেস সরবরাহ করে।
        </p>
        <p className="mb-4">
          এই ওয়েবসাইটটি techstudio.com.bd দ্বারা মালিকানাধীন, রক্ষণাবেক্ষণ এবং
          পরিচালিত হয় (এরপরে “আমরা” “আমাদের” “আমাদের সাইট” “ওয়েবসাইট” বা
          “সাইট” হিসাবে উল্লেখ করা হয়েছে।
        </p>
        <p className="mb-4">
          এখানে techstudio.com.bd এ, আমরা ব্যক্তিগত গোপনীয়তাকে খুব গুরুত্ব
          সহকারে নিই। গোপনীয়তা নীতি সমস্ত দর্শক, গ্রাহক, ক্রেতা এবং
          ব্যবহারকারীদের জন্য প্রযোজ্য (সম্পূর্ণ হিসাবে “ব্যবহারকারী” হিসাবে
          উল্লেখ করা হয়) এই গোপনীয়তা নীতি ব্যবহারকারীদের তথ্য সংগ্রহ করার
          উপায় ব্যাখ্যা করে, আমরা কীভাবে সেগুলি সংরক্ষণ করি এবং যখন আপনি ব্রাউজ
          বা টেকস্টুডিওডটকমডটবিডি ভিজিট করেন তখন সেই তথ্যটি ব্যবহার করি৷ com. এই
          নীতিটি সমস্ত উপায়ে প্রযোজ্য যার মাধ্যমে ওয়েবসাইটটি অ্যাক্সেস করা
          যেতে পারে।
        </p>
      </section>

      {/* Section 2: What Personal Data We Collect and Why */}
      <section className="mb-8">
        <h2 className="mb-4 text-2xl font-bold">
          আমরা কোন ব্যক্তিগত তথ্য সংগ্রহ করি এবং কেন আমরা তা সংগ্রহ করি :
        </h2>
        <p className="mb-4">
          আপনি যখন এই ওয়েবসাইটটি ব্যবহার করেন, তখন আমরা নির্দিষ্ট সময়ের মধ্যে
          সরবরাহ করা তথ্য সংগ্রহ ও সংরক্ষণ করি। এটি করার জন্য আমাদের প্রধান
          লক্ষ্য হল আপনাকে আরও ভাল, মসৃণ, দক্ষ এবং নিরাপদ অভিজ্ঞতা প্রদান করা।
          এই প্রক্রিয়ায়, আমরা শুধুমাত্র ব্যবহারকারীদের জন্য তথ্য সংগ্রহ করি যা
          আমরা এই উদ্দেশ্য অর্জনের জন্য অপরিহার্য বলে মনে করি।
        </p>
        <p className="mb-4">
          সাধারণত, ওয়েবসাইটটি আপনার ব্যক্তিগত তথ্য সংগ্রহ করে না যদি না আপনি
          আমাদের সেই তথ্য প্রদান করতে চান। আপনি যখন আমাদের আপনার ব্যক্তিগত তথ্য
          প্রদান করতে চান, তখন আপনি এই গোপনীয়তা নীতিতে তালিকাভুক্ত উল্লেখিত
          উদ্দেশ্যে সেই তথ্য ব্যবহার করার জন্য ওয়েবসাইটকে আপনার অনুমতি দিচ্ছেন।
          আপনি যদি আমাদের সেই তথ্য প্রদান না করতে চান, তাহলে এটি এই ওয়েবসাইটে
          ব্যবহার করতে পারেন এমন বৈশিষ্ট্য এবং পরিষেবাগুলিকে সীমিত করতে পারে।
        </p>
        <p className="mb-4">
          আপনি যখন https://techstudio.com.bd/ এর মাধ্যমে আমাদের ওয়েবসাইটে
          ক্রয়ের জন্য একটি অর্ডার দেন, তখন আমরা আপনার দেওয়া ব্যক্তিগত তথ্য
          সংগ্রহ করি যেমন, নাম, ডেলিভারির ঠিকানা, ইমেল ঠিকানা এবং যোগাযোগের
          নম্বর। আমরা আমাদের অনলাইন সাইটে আপনার অর্ডার প্রস্তুত করার জন্য আপনার
          তথ্য সংগ্রহ, সঞ্চয় এবং প্রক্রিয়া করি এবং ভবিষ্যতের সম্ভাব্য বিরোধ বা
          অভিযোগের সমাধানের জন্য এটি সংরক্ষণ করব।
        </p>
      </section>

      {/* Section 3: Minors */}
      <section className="mb-8">
        <h2 className="mb-4 text-2xl font-bold">নাবালক :</h2>
        <p className="mb-4">
          আমরা আমাদের ওয়েবসাইটে যে পরিষেবাগুলি প্রদান করি তা ব্যবহারকারীদের
          দ্বারা অ্যাক্সেস করার উদ্দেশ্যে যারা আইনত ক্রয় অর্ডার করতে বাধ্য।
          আমাদের ওয়েবসাইট, পরিষেবা, বিজ্ঞাপন, পৃষ্ঠাগুলির তথ্য, এমন কাউকে
          লক্ষ্য করা যায় না যারা কেনাকাটা করতে আইনত বাধ্য নয়৷ এই ইভেন্টে, 18
          বছরের কম বয়সী বা তার সমান নয় এমন কাউকে আমাদের পরিষেবা নেওয়ার
          প্রয়োজন হলে, আমরা পিতামাতা/অভিভাবকের তত্ত্বাবধানে তা করার পরামর্শ
          দিই। www.techstudio.com.bd আপনার ক্রয়ের অনুরোধ বা আপনার নিবন্ধন বন্ধ
          করার অধিকার সংরক্ষণ করে যে ক্ষেত্রে www.techstudio.com.bd সচেতন হয় যে
          আপনি 18 (প্রাপ্তবয়স্কদের) এর উপরে বা সমান নন।
        </p>
      </section>

      {/* Section 4: Third-Party Policies */}
      <section className="mb-8">
        <h2 className="mb-4 text-2xl font-bold">তৃতীয় পক্ষের নীতি :</h2>
        <p className="mb-4">
          আমরা পরিষেবাটি আরও ভাল করার উদ্দেশ্যে আমাদের সাথে অন্যান্য অনুমোদিত
          সংস্থাগুলিকে আপনার তথ্য সরবরাহ করতে পারি। আমরা আপনার কিছু তথ্য বিপণনের
          পাশাপাশি গ্রাহক পরিষেবার জন্য ডেটা বিশ্লেষণ করতে ব্যবহার করতে পারি।
          আমরা আমাদের রিটার্ন নীতি অনুযায়ী অর্থপ্রদান সংগ্রহ করতে, আপনার কাছে
          পণ্য সরবরাহ করতে এবং ফেরত আইটেম সংগ্রহ করতে তৃতীয় পক্ষকে ব্যবহার করতে
          পারি।
        </p>
        <p className="mb-4">
          আমরা যে পরিষেবাটি মসৃণ এবং আরও ভাল রেন্ডার করি তা করতে আমরা আমাদের
          ওয়েবসাইটে তৃতীয় পক্ষের প্লাগইনগুলি ব্যবহার করতে পারি। আমরা আমাদের
          ওয়েবসাইটে দর্শকদের সংখ্যা পরিমাপ করতে, সাইটে দর্শকদের সাথে যোগাযোগ
          করতে এবং আমাদের ওয়েবসাইটকে দর্শকদের জন্য আরও উপযোগী করতে এই তৃতীয়
          পক্ষের পরিষেবাগুলি ব্যবহার করি।
        </p>
        <p className="mb-4">
          এই ধরনের ক্ষেত্রে, তৃতীয়-প্লাগইনগুলি শুধুমাত্র নির্দিষ্ট কাজগুলি করার
          জন্য আপনার দেওয়া কিছু তথ্য ব্যবহার করতে পারে।
        </p>
        <p className="mb-4">
          যাইহোক, তৃতীয় পক্ষের প্লাগইন বা পরিষেবা প্রদানকারীদের একটি ভিন্ন
          গোপনীয়তা নীতি থাকতে পারে যা আমরা আপনার দ্বারা দেওয়া আদেশ(গুলি) পূরণ
          করার জন্য প্রদান করি।
        </p>
      </section>

      {/* Section 5: Security */}
      <section className="mb-8">
        <h2 className="mb-4 text-2xl font-bold">নিরাপত্তা :</h2>
        <p className="mb-4">
          আমরা আপনার কাছ থেকে সংগৃহীত আপনার ব্যক্তিগত তথ্য রক্ষা করার জন্য সমস্ত
          প্রয়োজনীয় সতর্কতা এবং পদক্ষেপ গ্রহণ করি এবং সম্পূর্ণ ফাইলিং ক্রয়
          অর্ডার বা আইনের দ্বারা প্রয়োজনীয় প্রকাশ ছাড়া আমাদের সংস্থার বাইরের
          যে কেউ এটিকে অ্যাক্সেসযোগ্য করে তুলি। এই সতর্কতাগুলির মধ্যে শুধুমাত্র
          অভ্যন্তরীণ কর্মীদের জন্য সেই তথ্যের অ্যাক্সেস সীমিত করার জন্য উন্নত
          অ্যাক্সেস নিয়ন্ত্রণ অন্তর্ভুক্ত রয়েছে যাদের সেই তথ্যে অ্যাক্সেস
          প্রয়োজন। আমাদের নিরাপত্তা ব্যবস্থা নিয়মিত আপগ্রেড করা হয় এবং সেগুলি
          কার্যকর হয় তা নিশ্চিত করার জন্য পরীক্ষা করা হয়।
        </p>
      </section>
    </main>
  );
}
